app/controllers/api/v1/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "user5"]]
---
      def create
        ret = validate_login
        if ret[:result]
          param_username = params[:username]
          param_password = params[:password]
          user = User.find_by(username: param_username)