app/controllers/api/v1/users_controller.rb

  def index
    user_id = params[:id]
    role_id = session[:role_id]
    #list user by manager and return users only
    if role_id == 2
      data = User.all.select(:id,:username, :picture, :role_id, :created_at, :updated_at).where("role_id = 3").order("created_at DESC")
    elsif role_id == 1
      data = User.all.select(:id,:username, :picture, :role_id, :created_at, :updated_at).order("created_at DESC")
    end

    results = Array.new()
    data.each do |row|
---
SELECT "users"."id", "users"."username", "users"."picture", "users"."role_id", "users"."created_at", "users"."updated_at" FROM "users" WHERE (role_id = 3)  ORDER BY created_at DESC
SELECT "users"."id", "users"."username", "users"."picture", "users"."role_id", "users"."created_at", "users"."updated_at" FROM "users"  ORDER BY created_at DESC
SELECT "users"."id", "users"."username", "users"."picture" FROM "users"

  def show
    user_id = params[:id].to_i()
    current_user_id = session[:user_id]
    role_id = session[:role_id]
    if role_id == 1 #admin can access all admin/managers/users
      data = User.select(:id, :username, :picture, :role_id).find(user_id)
---
SELECT  "users"."id", "users"."username", "users"."picture", "users"."role_id" FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]

  def create
    param_username = params[:username]
    param_password = params[:password]
    param_role_id = params[:role_id] == nil ? 3 : params[:role_id].to_i()
    current_role_id = session[:role_id]
    ret = validate_user_create
    if ret[:result]
      salt = BCrypt::Engine.generate_salt
      encrypted_password = BCrypt::Engine.hash_secret(param_password, salt)
      if current_role_id == 1
        ret = create_user(param_username, encrypted_password, salt, param_role_id)
      else
        ret = create_user(param_username, encrypted_password, salt)
      end
      render json: ret
    else
      render json: ret
    end
  end

  private def create_user(username, encrypted_password, salt, role_id = 3) #default role_id as 3 :user
    if role_id  <= 0 || role_id > 3
      ret = {result: false, message: "Invalid role id. #{role_id}"}
    else
      user = User.create(username: username, password: encrypted_password, salt:salt, role_id: role_id)
---
INSERT INTO "users" ("username", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "test1"], ["role_id", 3], ["created_at", "2016-02-04 07:07:09.761647"], ["updated_at", "2016-02-04 07:07:09.761647"]]

  def update
    param_username = params[:username]
    param_password = params[:password]
    param_picture = params[:picture]
    param_role_id = params[:role_id] == nil ? 3 : params[:role_id].to_i()
    current_role_id = session[:role_id]
    param_id = params[:id].to_i
    current_user_id = session[:user_id]
    ret = validate_user_update
    if ret[:result]
      user = User.find_by(id: param_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]

      ret = {result: false, message: "Invalid role id. #{role_id}"}
    else
      if role_id == nil
        user.update(username: username, picture: picture, password: encrypted_password)
---
UPDATE "users" SET "password" = $1, "salt" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password", "$2a$10$1O9744NYTZeAAHyMMq6KC.YDEyY2yh4wW1nG5HQN5DL/bCH4S1zT2"], ["salt", "$2a$10$1O9744NYTZeAAHyMMq6KC."], ["updated_at", "2016-01-26 08:43:31.457411"], ["id", 5]]

  def destroy
    param_id = params[:id].to_i()
    current_role_id = session[:role_id]
    current_user_id = session[:user_id]
    user = User.find_by(id: param_id)
    if user == nil
      render json: {result: false, message: "User id: #{param_id} cannot be found."}
      return
    end
    #manager(role_id = 2) can delete users, admin can delete all other users except self.
    if current_role_id == 2 && user['role_id'] == 3
      user.destroy()
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]